# Brewfile for macOS Homebrew Migration

# Taps for additional package sources
# Note: homebrew/bundle and homebrew/services are now part of core Homebrew
tap "oven-sh/bun"

#########################################
# CLI Tools & Development Environment  #
#########################################

# Shell Enhancement
brew "zsh"                    # Shell
brew "starship"               # Prompt
brew "zoxide"                 # Smart cd
brew "eza"                    # Better ls
brew "bat"                    # Better cat
brew "ripgrep"                # Better grep
brew "fd"                     # Better find
brew "fzf"                    # Fuzzy finder
brew "tree"                   # Directory tree
brew "stow"                   # Symlink manager

# Zsh plugins
brew "zsh-autosuggestions"    # Intelligent suggestions
brew "zsh-fast-syntax-highlighting"  # Fast syntax highlighting

# File Management & Network Tools
brew "rsync"                  # File synchronization
brew "curl"                   # HTTP client
brew "wget"                   # File downloader

# Text Processing
brew "sd"                     # sed alternative
brew "jq"                     # JSON processor
brew "yq"                     # YAML processor

# Development Essentials
brew "helix"                  # Modern editor
brew "direnv"                 # Environment management
brew "tmux"                   # Terminal multiplexer
brew "gh"                     # GitHub CLI
brew "git-delta"              # Git diff viewer
brew "git-flow"               # Git branching model
brew "lazygit"                # Git TUI
brew "git"                    # Version control

# Archive Utilities
brew "gnu-tar"                 # GNU tar (was gnutar)

# Media Utilities
brew "ffmpeg"
brew "imagemagick"

# System Info & Monitoring
brew "neofetch"               # System info
brew "htop"                   # Process monitor
brew "hyperfine"              # Benchmarking
brew "bandwhich"              # Network monitoring

#########################################
# Language Toolchains                  #
#########################################

# JavaScript/TypeScript Development
brew "bun"                    # Fast JavaScript runtime & package manager

# Rust Development
brew "rust"                   # Rust compiler and cargo
brew "rust-analyzer"          # Rust language server
brew "bacon"                  # Rust build tool

# Go Development
brew "go"                     # Go compiler
brew "gopls"                  # Go language server
brew "delve"                  # Go debugger
brew "golangci-lint"          # Go linter
brew "air"                    # Go live reload

# Python Development
brew "python@3.13"            # Python 3
brew "ruff"                   # Fast Python linter/formatter
brew "mypy"                   # Python type checking
brew "black"                  # Python code formatter

# Java Development
brew "gradle"                 # Build tool
brew "maven"                  # Build tool

# Build Tools
brew "cmake"
brew "ninja"
brew "pkg-config"
brew "make"
brew "gcc"

#########################################
# Container & DevOps Tools             #
#########################################

# Container Management
brew "docker"                 # Container runtime
brew "docker-compose"         # Container orchestration
brew "colima"                 # Docker runtime for macOS

#########################################
# Security & Password Management       #
#########################################

brew "1password-cli"          # 1Password CLI (may require manual install if unavailable)
brew "pinentry-mac"           # Pinentry for GPG


#########################################
# Network & Debugging Tools            #
#########################################

brew "dog"                    # DNS lookup tool (alternative: drill, dig)
brew "xh"                     # HTTP client (alternative to httpie)

#########################################
# Documentation Tools                  #
#########################################

brew "mdbook"                 # Markdown book generator
brew "pandoc"                 # Document converter

#########################################
# macOS-Specific Tools                 #
#########################################

brew "mas"                    # Mac App Store CLI
brew "pngpaste"               # Clipboard to PNG
brew "coreutils"              # GNU coreutils
brew "claude-code"            # Claude CLI Coding Agent (may require manual install)
cask "raycast"                # Spotlight replacement & productivity

#########################################
# Language Servers                     #
#########################################

brew "yaml-language-server"   # YAML language server
brew "bash-language-server"   # Bash language server
brew "marksman"               # Markdown language server
brew "dockerfile-language-server"  # Docker language server

#########################################
# GUI Applications (Casks)             #
#########################################

# Essential Applications
cask "1password"              # Password manager
cask "visual-studio-code"     # Code editor
cask "firefox"                # Web browser
cask "discord"                # Communication
cask "tailscale"              # VPN

# Media & Productivity
cask "handbrake"              # Video transcoding
cask "iina"                   # Video player
cask "calibre"                # eBook manager
cask "kobo"                   # Kobo eBook reader
cask "marta"                  # File manager
cask "hiddenbar"              # Menu bar organization
cask "keka"                   # Archive manager
cask "transmission"           # BitTorrent client
cask "jdownloader"            # Download manager
cask "usenapp"                # Usenet client

# Development Tools
cask "warp"                   # Terminal
cask "gitkraken"              # Git GUI
cask "ghidra"                 # Reverse engineering
cask "lm-studio"              # Local LLM hosting
cask "comfyui"                # UI for Stable Diffusion
cask "balenaetcher"           # USB/SD card OS image flasher
cask "kicad"                  # PCB design software

# Specialized Tools
cask "buzz"                   # Transcription
cask "rustdesk"               # Remote desktop
cask "secretive"              # SSH key management
cask "temurin"                # Java JDK
cask "setapp"                 # Subscription app platform

# Communication & Productivity
cask "proton-drive"           # Cloud storage
cask "proton-mail"            # Email client
cask "protonvpn"              # VPN client
cask "onedrive"               # Microsoft cloud storage

# Gaming & Entertainment
cask "steam"                  # Gaming platform
cask "pcsx2"                  # PlayStation 2 emulator
cask "parallels"              # Virtualization
cask "openrct2"               # RollerCoaster Tycoon 2 open source

# Hardware & System Utilities
cask "displaylink"            # Monitor management
cask "logi-options-plus"      # Logitech peripherals
cask "betterdisplay"          # Monitor management & resolution control
cask "macmousefix"            # Mouse acceleration & scrolling fixes (may require manual install)
cask "battery-toolkit"        # Battery management (may require manual install)

# Python Environment Management
cask "miniconda"              # Python environment management

# GitKraken CLI
cask "gitkraken-cli"          # Git CLI tools

#########################################
# Fonts and Terminal Customization      #
#########################################

cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
