# Brewfile for macOS Homebrew Migration

# Taps for additional package sources
tap "oven-sh/bun"
tap "italomandara/cxpatcher"
tap "mhaeuser/mhaeuser"
tap "probe-rs/probe-rs"

#########################################
# CLI Tools & Development Environment   #
#########################################

# Shell Enhancement
brew "zsh"                              # Shell
brew "starship"                         # Prompt
brew "zoxide"                           # Smart cd
brew "eza"                              # Better ls
brew "bat"                              # Better cat
brew "ripgrep"                          # Better grep
brew "fd"                               # Better find
brew "fzf"                              # Fuzzy finder
brew "tree"                             # Directory tree
brew "stow"                             # Symlink manager

# Zsh plugins
brew "zsh-autosuggestions"              # Intelligent suggestions
brew "zsh-fast-syntax-highlighting"     # Fast syntax highlighting
brew "zsh-history-substring-search"     # Search history by substring

# File Management & Network Tools
brew "rsync"                            # File synchronization
brew "curl"                             # HTTP client
brew "wget"                             # File downloader

# Text Processing
brew "sd"                               # sed alternative
brew "jq"                               # JSON processor
brew "yq"                               # YAML processor

# Development Essentials
brew "helix"                            # Modern editor
brew "direnv"                           # Environment management
brew "tmux"                             # Terminal multiplexer
brew "gh"                               # GitHub CLI
brew "git-delta"                        # Git diff viewer
brew "git-flow"                         # Git branching model
brew "git"                              # Version control

# Archive Utilities
brew "gnu-tar"

# Media Utilities
brew "ffmpeg"
brew "imagemagick"

# System Info & Monitoring
brew "nerdfetch"              # System info
brew "btop"                   # Process monitor
brew "hyperfine"              # Benchmarking
brew "bandwhich"              # Network monitoring
brew "gping"                  # Ping with graphs

#########################################
# Language Toolchains                  #
#########################################

# JavaScript/TypeScript Development
brew "oven-sh/bun/bun"                    # Fast JavaScript runtime & package manager

# Rust Development
brew "rust"                   # Rust compiler and cargo
brew "bacon"                  # Rust build tool

# Go Development
brew "go"                     # Go compiler
brew "delve"                  # Go debugger
brew "golangci-lint"          # Go linter
brew "air"                    # Go live reload

# Python Development
brew "python@3.14"            # Python 3
brew "ruff"                   # Fast Python linter/formatter
brew "mypy"                   # Python type checking

# Java Development
brew "gradle"                 # Build tool
brew "maven"                  # Build tool

# Build Tools
brew "cmake"
brew "ninja"
brew "pkg-config"
brew "make"
brew "gcc"

#########################################
# Container & DevOps Tools             #
#########################################

# Container Management
brew "docker"                       # Docker CLI
brew "docker-compose"               # Container orchestration (plugin + standalone)
brew "docker-credential-helper"     # macOS keychain integration
brew "colima"                       # Docker runtime for macOS

#########################################
# Security & Password Management       #
#########################################

cask "1password-cli"          # 1Password CLI
brew "pinentry-mac"           # Pinentry for GPG
brew "gnupg"                  # GPG for encryption/signing


#########################################
# Network & Debugging Tools            #
#########################################

brew "doggo"                  # DNS lookup tool
brew "xh"                     # HTTP client (alternative to httpie)

#########################################
# Documentation Tools                  #
#########################################

brew "mdbook"                 # Markdown book generator
brew "pandoc"                 # Document converter

#########################################
# macOS-Specific Tools                 #
#########################################

brew "mas"                    # Mac App Store CLI
brew "pngpaste"               # Clipboard to PNG
brew "coreutils"              # GNU coreutils
cask "raycast"                # Spotlight replacement & productivity
cask "connectmenow"           # Mount network shares quick and easy

#########################################
# GUI Applications (Casks)             #
#########################################

# Essential Applications
cask "1password"              # Password manager
cask "visual-studio-code"     # Code editor
cask "jetbrains-toolbox"      # JetBrains Toolbox
cask "firefox"                # Web browser
cask "tailscale-app"              # VPN

# Media & Productivity
cask "handbrake-app"              # Video transcoding
cask "iina"                   # Video player
cask "kobo"                   # Kobo eBook reader
cask "hiddenbar"              # Menu bar organization
cask "keka"                   # Archive manager
cask "transmission"           # BitTorrent client
cask "jdownloader"            # Download manager
cask "usenapp"                # Usenet client

# Development Tools
cask "warp"                   # Terminal
cask "fork"                   # Git GUI
brew "ghidra"                 # Reverse engineering
cask "balenaetcher"           # USB/SD card OS image flasher
cask "kicad"                  # PCB design software

# Specialized Tools
cask "buzz"                   # Transcription
cask "rustdesk"               # Remote desktop
cask "secretive"              # SSH key management
cask "temurin"                # Java JDK
cask "setapp"                 # Subscription app platform

# Communication & Productivity
cask "proton-drive"           # Cloud storage
cask "proton-mail"            # Email client
cask "protonvpn"              # VPN client

# Gaming & Entertainment
cask "steam"                  # Gaming platform
cask "pcsx2"                  # PlayStation 2 emulator
cask "parallels"              # Virtualization
cask "openrct2"               # RollerCoaster Tycoon 2 open source
cask "crossover"              # Run Windows apps on macOS

# Hardware & System Utilities
cask "displaylink"            # Monitor management
cask "logi-options-plus"      # Logitech peripherals
cask "betterdisplay"          # Monitor management & resolution control
cask "bettermouse"            # Mouse acceleration & scrolling fixes
cask "battery-toolkit"        # Battery management

# Python Environment Management
cask "miniconda"                        # Python environment management

#########################################
# Fonts and Terminal Customization      #
#########################################

cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"

#########################################
# Mac App Store Applications            #
#########################################
mas 1569813296  # 1Password for Safari        (8.11.22)
mas 1168254295  # AmorphousDiskMark           (4.0.1)
mas 6502451661  # Balatro                     (1.0.20)
mas 425264550   # Blackmagic Disk Speed Test  (3.4.2)
mas 488920185   # Disk Space Analyzer Pro     (6.0)
mas 1136220934  # Infuse                      (8.3.4)
mas 409183694   # Keynote                     (14.4)
mas 441258766   # Magnet                      (3.0.7)
mas 1592917505  # Noir                        (2025.2.7)
mas 409203825   # Numbers                     (14.4)
mas 409201541   # Pages                       (14.4)
mas 375589283   # Parcel                      (8.2.4)
mas 6702028686  # RCT Classic+                (1.0.435)
mas 1465346522  # Sasquatch                   (2.1.4)
mas 1475387142  # Tailscale                   (1.90.9)
mas 1295203466  # Windows App                 (11.3.0)
mas 1662217862  # Wipr                        (2.15)
mas 497799835   # Xcode                       (26.1.1)